---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Plumbing.PipeScheduleType
source: html/f244bcf3-97ba-4601-f85d-27c17a282add.htm
---
# PipeScheduleType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.